Revit 2027 API
BuiltInFailures.SketchFailures.CurveIntersectsCutFace Property
 The highlighted line intersects the boundary of the face being modified. To modify a cut face, use open loops that end on the existing boundary without intersecting or overlapping existing edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveIntersectsCutFace { get; }
Public Shared ReadOnly Property CurveIntersectsCutFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveIntersectsCutFace {
	FailureDefinitionId^ get ();
}
static member CurveIntersectsCutFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace